DataProcessors/ТТМ_ЗагрузкаДанныхОПроверкеСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТТМ_ЗагрузкаДанныхОПроверкеСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСведение</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеСведения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТТМ_ПроверенныеСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТТМ_ПроверенныеСпецификации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпецификацияПроверена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТТМ_ЗагрузкаДанныхОПроверкеСпецификаций/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Процедура ЗаполнитьРегистрНаСервере(ДополнительноеСведение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеСведения.Объект КАК Спецификация,
	               |	ДополнительныеСведения.Свойство КАК Свойство,
	               |	ДополнительныеСведения.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |ГДЕ
	               |	ДополнительныеСведения.Свойство = &ДополнительноеСведение
	               |	И ДополнительныеСведения.Значение = ИСТИНА";
	Запрос.УстановитьПараметр("ДополнительноеСведение",ДополнительноеСведение);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТЗ из ТЗ Цикл 
		НЗ = РегистрыСведений.ТТМ_ПроверенныеСпецификации.СоздатьНаборЗаписей();
		НЗ.Отбор.Спецификация.Установить(СтрТЗ.Спецификация);
		НЗ.Прочитать();
		Если НЗ.Количество() = 0 Тогда 
			НоваяЗапись = НЗ.Добавить();
			НоваяЗапись.Спецификация = СтрТЗ.Спецификация;
			НоваяЗапись.СпецификацияПроверена = Истина; 
			НоваяЗапись.Период = НачалоДня(ТекущаяДатаСеанса());
			НоваяЗапись.Проверил = Пользователи.АвторизованныйПользователь();
		КонецЕсли;                                              
		НЗ.Записать();
	КонецЦикла;                                                 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРегистр(Команда)
	ЗаполнитьРегистрНаСервере(Объект.ДополнительноеСведение);
КонецПроцедуры
